{
  "title": "Cover Letter",
  "hello": "Hello,",
  "p1": "My name is Hugo Leonardo, and I am a Full Stack Developer from Belo Horizonte, Brazil. Since 2020, I have been working as a web developer with a strong focus on frontend development. I have led a team of three frontend developers, a tester, and a designer, where we successfully built a new product and maintained an existing one. Our work involved meticulous planning and priority setting using backlog grooming at the start of each sprint. We documented everything in Confluence and tracked tasks with Jira and Gitflow. During my tenure, we managed to eliminate all bugs in the existing application, allowing us to deliver a new student module in record time. This role greatly enhanced my project and team management skills.",
  "p2": "For the past two and a half years, I worked at an American company serving a client in the fiduciary sector, a complex field involving national security issues. Initially, I focused on test automation using Cypress and jQuery, which was very motivating. However, when my role shifted towards manual testing, it no longer aligned with my career aspirations as a programmer. After careful consideration, I decided to seek new opportunities.",
  "p3": "Recently, I dedicated several months to a personal full-stack project. As a skater in my free time, I noticed the lack of a quality website for the skating community. Most available sites were either poorly designed or merely online stores. This led me to create Rollers Hub, an application aimed at connecting skaters worldwide. Developed with the support of a skater community, I continue to enhance the site with new features in my spare time.",
  "p4": "I am currently seeking a full-stack web developer position where I can apply my skills and continue to grow professionally. I am particularly drawn to [Company Name] because [specific reason related to the company or role]. I am confident that my experience in team leadership, test automation, and full-stack development makes me a strong candidate for this position. I am excited to work with you and look forward to joining your team!",
  "p5": "Thank you for your consideration. I look forward to the possibility of discussing how I can contribute to your team.",
  "regards": "Best regards,",
  "signature": "Hugo Leonardo - Full Stack Developer"
}
