[
  {
    "company": "Xgrow",
    "role": "Senior Frontend Developer",
    "duration": "June 2021 - December 2021",
    "location": "Orlando, USA",
    "tasks": [
      "Led a team of three frontend developers, one tester, and one designer.",
      "Solved numerous technical problems and collaborated in building a new module for the platformU+2019s students.",
      "Used agile methodologies to plan and execute effective sprints, documenting processes in Confluence and tracking tasks in Jira.",
      "Managed to eliminate all bugs in the existing application, enabling the delivery of new features in record time.",
      "Developed innovative and effective solutions through idea exchanges and experience sharing, prior to the existence of tools like ChatGPT."
    ]
  },
  {
    "company": "Confidential",
    "role": "Test Automation Developer",
    "duration": "January 2022 - January 2024",
    "location": "Portland, USA",
    "tasks": [
      "Received an offer to work at an American software house with a client in the fiduciary sector, where I remained for 2 years.",
      "Focused primarily on test automation and quality control, using tools like Cypress and automated testing frameworks.",
      "Developed and maintained automation scripts to ensure consistency and efficiency of tests, contributing to the clientU+2019s software stability.",
      "Worked in a high-security environment, adhering to strict confidentiality and data integrity protocols.",
      "I can't speak much about this position, because there are a lot of confidential things to say."
    ]
  },
  {
    "company": "MT Corp (CRM Project)",
    "role": "Temporary Frontend Developer",
    "duration": "July 2023 - December 2023",
    "location": "São Paulo, Brazil",
    "tasks": [
      "Worked on a temporary contract in a CRM project, contributing to the final development stage of the application.",
      "Participated in the construction of various system modules, ensuring integration and functionality of each component.",
      "Assisted the testing team in bug resolution and implementation of manual tests to ensure the final product's quality after the development phase.",
      "Collaborated with different departments to improve workflow efficiency and internal communication.",
      "I was hired just to help to delivery the project in time. Also I was keeping my skills up to"
    ]
  }
]
